read_verilog "C:/Users/Davi/Desktop/RTL_EXP/.rtl_explorer_build/rtl_explorer_design.v"
hierarchy -check -top rtl_explorer_top
proc; flatten; opt; memory; opt
write_json "C:/Users/Davi/Desktop/RTL_EXP/.rtl_explorer_build/netlist.json"
write_cxxrtl -O3 -g2 "C:/Users/Davi/Desktop/RTL_EXP/.rtl_explorer_build/cxxrtl_model.cpp"
